#### StructuralReleaseType Enumeration

---

|  |
| --- |
| See Also |

Type of structural release, which is used for the BuiltIn parameter STRUCTURAL\_END\_RELEASE\_TYPE.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum StructuralReleaseType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration StructuralReleaseType ``` |

| Visual C++ |
| --- |
| ``` public enum class StructuralReleaseType ``` |

# Members

| Member name | Description |
| --- | --- |
| kFixed |  |
| kPinned |  |
| kBendingMoment |  |
| kUserDefined |  |

# See Also

Autodesk.Revit.DB Namespace